import FaqItem from "@/components/landing/faqItems";

export default function FAQ() {
  return (
    <section id="faq" className="py-16 md:py-24 bg-darkPrimary text-white">
      <div className="container mx-auto px-4">
        <div className="text-center max-w-2xl mx-auto mb-16">
          <h2 className="text-3xl md:text-4xl font-morabba-bold mb-4">
            سوالات متداول
          </h2>
          <p className="text-stone-300">
            پاسخ سوالات رایج درباره خدمات مِنو کافه
          </p>
        </div>

        <div className="grid md:grid-cols-2 gap-x-12 gap-y-8 max-w-4xl mx-auto">
          <FaqItem
            question="آیا می‌توانم منوی خود را سفارشی‌سازی کنم؟"
            answer="بله، شما می‌توانید رنگ‌ها، فونت‌ها و طرح کلی منو را مطابق با برند خود سفارشی‌سازی کنید. در پلن‌های پیشرفته و سازمانی، امکانات سفارشی‌سازی بیشتری در دسترس است."
          />
          <FaqItem
            question="آیا نیاز به نصب نرم‌افزار خاصی است؟"
            answer="خیر، مِنو کافه یک سرویس تحت وب است و برای استفاده از آن تنها به اینترنت و یک مرورگر نیاز دارید. همچنین اپلیکیشن موبایل ما نیز برای مدیریت آسان‌تر در دسترس است."
          />
          <FaqItem
            question="آیا مشتریان برای دیدن منو نیاز به نصب اپلیکیشن دارند؟"
            answer="خیر، مشتریان می‌توانند با اسکن QR کد، منوی شما را مستقیماً در مرورگر خود مشاهده کنند. هیچ نیازی به نصب اپلیکیشن نیست."
          />
          <FaqItem
            question="آیا امکان سفارش آنلاین هم وجود دارد؟"
            answer="بله، در پلن‌های پیشرفته و سازمانی، امکان سفارش آنلاین و پرداخت آنلاین نیز وجود دارد و می‌توانید سیستم سفارش‌گیری خود را با مِنو کافه یکپارچه کنید."
          />
          <FaqItem
            question="آیا می‌توانم منو را به زبان‌های مختلف ارائه دهم؟"
            answer="بله، شما می‌توانید منوی خود را به چندین زبان تنظیم کنید که این ویژگی برای کافه‌های با مشتریان بین‌المللی بسیار مفید است."
          />
          <FaqItem
            question="آیا پشتیبانی فنی ارائه می‌دهید؟"
            answer="بله، ما پشتیبانی فنی برای همه پلن‌ها ارائه می‌دهیم. در پلن‌های پیشرفته و سازمانی، پشتیبانی اختصاصی و سریع‌تر در دسترس است."
          />
        </div>
      </div>
    </section>
  );
}
